import React, { useEffect, useState } from "react";
import "./App.css";
import { Link, useNavigate, useLocation } from "react-router-dom";

export default function Timetable() {
  // timetable 배열 상태 관리
  /*
  const [timetable, setTimetable] = useState([
    ['1교시','B','G','D','D','F'],
    ['2교시','','','','H','A'],
    ['3교시','C','C','E','','D'],
    ['4교시','H','A','','',''],
    ['5교시','','','C','F','G'],
    ['6교시','','자율','동아리','A','B'],
    ['7교시','E','','','B','']
  ]);
  */
  const [timetable, setTimetable] = useState([[[['1교시', '통사1', '공수1', '통과1', '통사1', '공영1'], ['2교시', '음악', '기가', '여유', '진로', '한국1'], ['3교시', '체육1', '과탐', '통사1', '기가', '공수1'], ['4교시', '한국1', '공국1', '통과1', '통과1', '통과1'], ['5교시', '공수1', '한국1', '공국1', '음악', '공국1'], ['6교시', '체육1', '자율', '동아', '공수1', '기가'], ['7교시', '공영1', '자율', '', '공영1', '통사1']], [['1교시', '기가', '통사1', '공영1', '통과1', '진로'], ['2교시', '여유', '공영1', '공국1', '공국1', '기가'], ['3교시', '공수1', '체육1', '공수1', '공수1', '통과1'], ['4교시', '체육1', '음악', '한국1', '한국1', '공수1'], ['5교시', '통사1', '과탐', '통사1', '기가', '통사1'], ['6교시', '통과1', '자율', '동아', '공영1', '공국1'], ['7교시', '한국1', '자율', '', '음악', '통과1']], [['1교시', '음악', '한국1', '공수1', '공영1', '공수1'], ['2교시', '공수1', '공국1', '통사1', '기가', '진로'], ['3교시', '한국1', '통과1', '기가', '과탐', '여유'], ['4교시', '체육1', '통사1', '음악', '공국1', '체육1'], ['5교시', '공국1', '기가', '한국1', '공수1', '공영1'], ['6교시', '통과1', '자율', '동아', '통사1', '통사1'], ['7교시', '공영1', '자율', '', '통과1', '통과1']], [['1교시', '체육1', '음악', '통과1', '공영1', '한국1'], ['2교시', '공영1', '한국1', '통사1', '공수1', '통과1'], ['3교시', '공국1', '통사1', '진로', '통사1', '통사1'], ['4교시', '과탐', '공수1', '공영1', '체육1', '공국1'], ['5교시', '통과1', '여유', '기가', '공국1', '기가'], ['6교시', '공수1', '자율', '동아', '한국1', '음악'], ['7교시', '기가', '자율', '', '통과1', '공수1']], [['1교시', '공영1', '체육1', '음악', '진로', '한국1'], ['2교시', '공국1', '여유', '공국1', '음악', '체육1'], ['3교시', '기가', '기가', '공수1', '공수1', '통사1'], ['4교시', '공수1', '통사1', '한국1', '공국1', '공영1'], ['5교시', '과탐', '통과1', '통사1', '한국1', '공수1'], ['6교시', '통사1', '자율', '동아', '통과1', '통과1'], ['7교시', '통과1', '자율', '', '공영1', '기가']], [['1교시', '한국1', '체육1', '한국1', '공국1', '공영1'], ['2교시', '체육1', '공수1', '기가', '과탐', '통과1'], ['3교시', '통과1', '공국1', '통과1', '공영1', '음악'], ['4교시', '통사1', '한국1', '공영1', '통사1', '공수1'], ['5교시', '기가', '여유', '통사1', '통과1', '진로'], ['6교시', '공수1', '자율', '동아', '기가', '통사1'], ['7교시', '음악', '자율', '', '공수1', '공국1']], [['1교시', '진로', '통사1', '한국1', '통사1', '미술'], ['2교시', '미술', '체육1', '공수1', '정보', '정보'], ['3교시', '통과1', '정보', '공국1', '공국1', '여유'], ['4교시', '한국1', '공영1', '과탐', '공수1', '통사1'], ['5교시', '공국1', '공수1', '통과1', '통과1', '통과1'], ['6교시', '통사1', '자율', '동아', '공영1', '체육1'], ['7교시', '공수1', '자율', '', '한국1', '공영1']], [['1교시', '공수1', '공수1', '통사1', '과탐', '통과1'], ['2교시', '체육1', '통과1', '한국1', '여유', '공수1'], ['3교시', '통사1', '통사1', '공영1', '미술', '공영1'], ['4교시', '정보', '공영1', '통과1', '공국1', '통사1'], ['5교시', '진로', '체육1', '미술', '정보', '정보'], ['6교시', '한국1', '자율', '동아', '공수1', '한국1'], ['7교시', '공국1', '자율', '', '통과1', '공국1']], [['1교시', '통과1', '미술', '미술', '정보', '통과1'], ['2교시', '한국1', '공영1', '통사1', '통사1', '통사1'], ['3교시', '정보', '통과1', '공국1', '공수1', '공국1'], ['4교시', '공영1', '공수1', '정보', '한국1', '한국1'], ['5교시', '공수1', '공국1', '공영1', '진로', '여유'], ['6교시', '체육1', '자율', '동아', '과탐', '공수1'], ['7교시', '통사1', '자율', '', '통과1', '체육1']], [['1교시', '한국1', '통과1', '공수1', '체육1', '공국1'], ['2교시', '통사1', '공국1', '한국1', '통과1', '체육1'], ['3교시', '공영1', '미술', '통사1', '공영1', '통과1'], ['4교시', '과탐', '한국1', '진로', '통사1', '여유'], ['5교시', '정보', '정보', '정보', '공수1', '공수1'], ['6교시', '공수1', '자율', '동아', '공국1', '공영1'], ['7교시', '통과1', '자율', '', '미술', '통사1']], [['1교시', '공수1', '통사1', '한국1', '공영1', '통사1'], ['2교시', '한국1', '한국1', '공수1', '공수1', '미술'], ['3교시', '통사1', '통과1', '통과1', '여유', '공수1'], ['4교시', '공국1', '공국1', '공국1', '정보', '공영1'], ['5교시', '통과1', '미술', '과탐', '통사1', '체육1'], ['6교시', '공영1', '자율', '동아', '진로', '정보'], ['7교시', '정보', '자율', '', '체육1', '통과1']], [['1교시', '한국1', '공국1', '통과1', '통사1', '통과1'], ['2교시', '과탐', '정보', '공영1', '정보', '공수1'], ['3교시', '공수1', '통사1', '한국1', '체육1', '체육1'], ['4교시', '통과1', '통과1', '미술', '여유', '진로'], ['5교시', '통사1', '공영1', '공수1', '공국1', '공영1'], ['6교시', '미술', '자율', '동아', '공수1', '통사1'], ['7교시', '공국1', '자율', '', '한국1', '정보']]],[[['1교시', '환경D', '문학', '일본F1', '중국', '영어1'], ['2교시', '한지A', '생명B1', '화작C', '수학1', '수학1'], ['3교시', '문학', '여유', '운동', '한지A', '중국'], ['4교시', '운동', '영어1', '영어1', '생명B1', '생명B1'], ['5교시', '화작C', '한지A', '수학1', '영어1', '문학'], ['6교시', '생명B1', '자율', '동아', '문학', '진로'], ['7교시', '수학1', '자율', '', '일본F1', '한지A']], [['1교시', '화작D1', '수학1', '일본F2', '환경E1', '수학1'], ['2교시', '사문A1', '생명B2', '기하C', '문학', '문학'], ['3교시', '영어1', '문학', '문학', '사문A1', '진로'], ['4교시', '수학1', '영어1', '영어1', '생명B2', '생명B2'], ['5교시', '기하C', '사문A1', '여유', '수학1', '영어1'], ['6교시', '생명B2', '자율', '동아', '운동', '화작D1'], ['7교시', '운동', '자율', '', '일본F2', '사문A1']], [['1교시', '화작D2', '문학', '중국', '환경E2', '영어1'], ['2교시', '사문A2', '생명B3', '진영C', '영어1', '여유'], ['3교시', '운동', '영어1', '수학1', '사문A2', '진로'], ['4교시', '문학', '수학1', '문학', '생명B3', '생명B3'], ['5교시', '진영C', '사문A2', '운동', '문학', '수학1'], ['6교시', '생명B3', '자율', '동아', '수학1', '화작D2'], ['7교시', '영어1', '자율', '', '중국', '사문A2']], [['1교시', '기하D', '문학', '교육F', '화작E', '운동'], ['2교시', '윤사A', '지구B', '공실', '수학1', '영어1'], ['3교시', '문학', '수학1', '문학', '윤사A', '화작E'], ['4교시', '영어1', '여유', '수학1', '지구B', '지구B'], ['5교시', '공실', '윤사A', '영어1', '영어1', '문학'], ['6교시', '지구B', '자율', '동아', '운동', '기하D'], ['7교시', '수학1', '자율', '', '진로', '윤사A']], [['1교시', '공실', '영어1', '보건', '기하E', '수학1'], ['2교시', '세사A', '한지B', '미창C1', '문학', '문학'], ['3교시', '영어1', '운동', '영어1', '세사A', '기하E'], ['4교시', '수학1', '문학', '문학', '한지B', '한지B'], ['5교시', '미창C1', '세사A', '수학1', '수학1', '여유'], ['6교시', '한지B', '자율', '동아', '영어1', '공실'], ['7교시', '운동', '자율', '', '진로', '세사A']], [['1교시', '한문D', '수학1', '환경F', '영문E', '문학'], ['2교시', '경제A', '사문B1', '미창C2', '운동', '영어1'], ['3교시', '수학1', '문학', '영어1', '경제A', '영문E'], ['4교시', '영어1', '영어1', '여유', '사문B1', '사문B1'], ['5교시', '미창C2', '경제A', '운동', '문학', '수학1'], ['6교시', '사문B1', '자율', '동아', '수학1', '한문D'], ['7교시', '문학', '자율', '', '진로', '경제A']], [['1교시', '보건', '수학1', '화작F1', '공실', '문학'], ['2교시', '물리A', '사문B2', '일본C', '영어1', '여유'], ['3교시', '수학1', '영어1', '영어1', '물리A', '공실'], ['4교시', '문학', '운동', '수학1', '사문B2', '사문B2'], ['5교시', '일본C', '물리A', '문학', '수학1', '운동'], ['6교시', '사문B2', '자율', '동아', '문학', '진로'], ['7교시', '영어1', '자율', '', '화작F1', '물리A']], [['1교시', '미창D1', '영어1', '화작F2', '보건', '영어1'], ['2교시', '화학A1', '윤사B1', '중국', '수학1', '운동'], ['3교시', '영어1', '여유', '수학1', '화학A1', '진로'], ['4교시', '수학1', '문학', '운동', '윤사B1', '윤사B1'], ['5교시', '중국', '화학A1', '문학', '영어1', '수학1'], ['6교시', '윤사B1', '자율', '동아', '문학', '미창D1'], ['7교시', '문학', '자율', '', '화작F2', '화학A1']], [['1교시', '일본D1', '운동', '기하F', '미창E1', '수학1'], ['2교시', '화학A2', '윤사B2', '교육C', '문학', '영어1'], ['3교시', '문학', '수학1', '문학', '화학A2', '미창E1'], ['4교시', '영어1', '여유', '영어1', '윤사B2', '윤사B2'], ['5교시', '진로', '화학A2', '수학1', '운동', '문학'], ['6교시', '윤사B2', '자율', '동아', '영어1', '일본D1'], ['7교시', '수학1', '자율', '', '기하F', '화학A2']], [['1교시', '일본D2', '문학', '영어1', '미창E2', '문학'], ['2교시', '생명A1', '세사B', '보건', '수학1', '수학1'], ['3교시', '공실', '공실', '운동', '생명A1', '미창E2'], ['4교시', '수학1', '운동', '수학1', '세사B', '세사B'], ['5교시', '진로', '생명A1', '문학', '문학', '영어1'], ['6교시', '세사B', '자율', '동아', '여유', '일본D2'], ['7교시', '영어1', '자율', '', '영어1', '생명A1']], [['1교시', '중국', '수학1', '미창F', '일본E1', '수학1'], ['2교시', '생명A2', '물리B', '환경C1', '영어1', '문학'], ['3교시', '수학1', '운동', '수학1', '생명A2', '일본E1'], ['4교시', '영어1', '문학', '여유', '물리B', '물리B'], ['5교시', '진로', '생명A2', '영어1', '운동', '영어1'], ['6교시', '물리B', '자율', '동아', '문학', '중국'], ['7교시', '문학', '자율', '', '미창F', '생명A2']], [['1교시', '미창D2', '영어1', '공실', '일본E2', '영어1'], ['2교시', '지구A', '화학B', '환경C2', '운동', '문학'], ['3교시', '운동', '문학', '영어1', '지구A', '일본E2'], ['4교시', '문학', '수학1', '문학', '화학B', '화학B'], ['5교시', '진로', '지구A', '여유', '수학1', '수학1'], ['6교시', '화학B', '자율', '동아', '영어1', '미창D2'], ['7교시', '수학1', '자율', '', '공실', '지구A']]],[[['1교시', '화학2B', '진로', '세지D', '세지D', '한문2F'], ['2교시', '생환', '확통', '스생', '독서', '고전A1'], ['3교시', '생윤C1', '생윤C1', '여지E', '확통', '세지D'], ['4교시', '영작', '고전A1', '여유', '영작', '영작'], ['5교시', '독서', '독서', '생윤C1', '한문2F', '드로G'], ['6교시', '확통', '자율', '동아', '고전A1', '화학2B'], ['7교시', '여지E', '자율', '', '화학2B', '생환']], [['1교시', '생명2B', '진로', '정법D', '정법D', '독서'], ['2교시', '여유', '생환', '영작', '융합H', '고전A2'], ['3교시', '생윤C2', '생윤C2', '사탐E', '스생', '정법D'], ['4교시', '융합H', '고전A2', '확통', '영작', '생환'], ['5교시', '영작', '확통', '생윤C2', '독서', '미비G'], ['6교시', '독서', '자율', '동아', '고전A2', '생명2B'], ['7교시', '사탐E', '자율', '', '생명2B', '확통']], [['1교시', '고전B', '지재G', '생윤D', '생윤D', '드로F'], ['2교시', '확통', '영작', '확통', '생활H1', '심국A'], ['3교시', '화학2C', '화학2C', '고윤E', '여유', '생윤D'], ['4교시', '생활H1', '심국A', '독서', '독서', '영작'], ['5교시', '스생', '독서', '화학2C', '진로', '지재G'], ['6교시', '영작', '자율', '동아', '심국A', '고전B'], ['7교시', '고윤E', '자율', '', '고전B', '확통']], [['1교시', '심국B1', '일회G', '동사D', '동사D', '음연'], ['2교시', '영작', '영작', '영작', '생활H2', '경수A'], ['3교시', '생명2C', '생명2C', '세미E', '확통', '동사D'], ['4교시', '생활H2', '경수A', '스생', '독서', '확통'], ['5교시', '확통', '여유', '생명2C', '진로', '일회G'], ['6교시', '독서', '자율', '동아', '경수A', '심국B1'], ['7교시', '세미E', '자율', '', '심국B1', '독서']], [['1교시', '심국B2', '한문2G', '물리2D', '물리2D', '여지F'], ['2교시', '영작', '확통', '독서', '진로', '미적A'], ['3교시', '지구2C', '지구2C', '융합E', '영작', '물리2D'], ['4교시', '음연', '미적A', '여유', '확통', '스생'], ['5교시', '독서', '독서', '지구2C', '여지F', '한문2G'], ['6교시', '확통', '자율', '동아', '미적A', '심국B2'], ['7교시', '융합E', '자율', '', '심국B2', '영작']], [['1교시', '경수B', '사탐G1', '화학2D', '화학2D', '지재F'], ['2교시', '영작', '여유', '영작', '진로', '수탐A'], ['3교시', '고전C', '고전C', '생활E1', '영작', '화학2D'], ['4교시', '음비H', '수탐A', '독서', '확통', '독서'], ['5교시', '스생', '독서', '고전C', '지재F', '사탐G1'], ['6교시', '확통', '자율', '동아', '수탐A', '경수B'], ['7교시', '생활E1', '자율', '', '경수B', '확통']], [['1교시', '미적B', '사탐G2', '생명2D', '생명2D', '프로F'], ['2교시', '여유', '독서', '스생', '진로', '심영A'], ['3교시', '심국C', '심국C', '생활E2', '확통', '생명2D'], ['4교시', '드로H', '심영A', '영작', '영작', '확통'], ['5교시', '독서', '확통', '심국C', '프로F', '사탐G2'], ['6교시', '영작', '자율', '동아', '심영A', '미적B'], ['7교시', '생활E2', '자율', '', '미적B', '독서']], [['1교시', '수탐B', '진로', '고전D', '고전D', '일회F'], ['2교시', '스생', '확통', '확통', '지재H', '세지A'], ['3교시', '미적C1', '미적C1', '생활E3', '여유', '고전D'], ['4교시', '지재H', '세지A', '독서', '독서', '영작'], ['5교시', '확통', '영작', '미적C1', '일회F', '음비G'], ['6교시', '영작', '자율', '동아', '세지A', '수탐B'], ['7교시', '생활E3', '자율', '', '수탐B', '독서']], [['1교시', '심영B', '융합G', '심국D1', '심국D1', '중회F'], ['2교시', '독서', '스생', '영작', '일회H1', '생윤A1'], ['3교시', '미적C2', '미적C2', '음연', '독서', '심국D1'], ['4교시', '일회H1', '생윤A1', '확통', '영작', '독서'], ['5교시', '확통', '확통', '미적C2', '중회F', '융합G'], ['6교시', '여유', '자율', '동아', '생윤A1', '심영B'], ['7교시', '진로', '자율', '', '심영B', '영작']], [['1교시', '정법B', '생활G1', '심국D2', '심국D2', '사탐F1'], ['2교시', '확통', '영작', '독서', '일회H2', '생윤A2'], ['3교시', '수탐C', '수탐C', '음비E', '독서', '심국D2'], ['4교시', '일회H2', '생윤A2', '영작', '확통', '확통'], ['5교시', '독서', '여유', '수탐C', '사탐F1', '생활G1'], ['6교시', '스생', '자율', '동아', '생윤A2', '정법B'], ['7교시', '진로', '자율', '', '정법B', '영작']], [['1교시', '생윤B1', '생활G2', '미적D1', '미적D1', '사탐F2'], ['2교시', '여유', '영작', '확통', '여지H', '동사A'], ['3교시', '심영C', '심영C', '드로E', '영작', '미적D1'], ['4교시', '여지H', '동사A', '스생', '독서', '독서'], ['5교시', '영작', '독서', '심영C', '사탐F2', '생활G2'], ['6교시', '확통', '자율', '동아', '동사A', '생윤B1'], ['7교시', '진로', '자율', '', '생윤B1', '확통']], [['1교시', '생윤B2', '진로', '미적D2', '미적D2', '생활F1'], ['2교시', '독서', '여유', '확통', '사탐H', '물리2A'], ['3교시', '심독C', '심독C', '지재E', '영작', '미적D2'], ['4교시', '사탐H', '물리2A', '독서', '독서', '영작'], ['5교시', '확통', '스생', '심독C', '생활F1', '음연'], ['6교시', '영작', '자율', '동아', '물리2A', '생윤B2'], ['7교시', '지재E', '자율', '', '생윤B2', '확통']], [['1교시', '동사B', '영작', '수탐D', '수탐D', '생활F2'], ['2교시', '확통', '확통', '독서', '세미H', '생명2A'], ['3교시', '세지C', '세지C', '프로E', '음연', '수탐D'], ['4교시', '세미H', '생명2A', '확통', '스생', '진로'], ['5교시', '영작', '여유', '세지C', '생활F2', '독서'], ['6교시', '독서', '자율', '동아', '생명2A', '동사B'], ['7교시', '프로E', '자율', '', '동사B', '영작']], [['1교시', '물리2B', '여지G', '심영D', '심영D', '영작'], ['2교시', '진로', '독서', '독서', '현변H', '지구2A'], ['3교시', '정법C', '정법C', '일회E', '독서', '심영D'], ['4교시', '현변H', '지구2A', '여유', '영작', '확통'], ['5교시', '영작', '확통', '정법C', '음연', '여지G'], ['6교시', '확통', '자율', '동아', '지구2A', '물리2B'], ['7교시', '일회E', '자율', '', '물리2B', '스생']]]]);
 
  
  const [newRow, setNewRow] = useState(Array(8).fill('')); // 새로운 행에 추가할 값들
  const [grade, setGrade] = useState(1);
  const [classroom, setClassroom] = useState(1);

  // 새로운 행 추가 함수
  const addRow = () => {
    setTimetable([...timetable, newRow]);
    setNewRow(Array(8).fill('')); // 새로운 행을 추가한 후, 입력값 초기화
  };

  // 입력값을 상태에 반영하는 함수
  const handleInputChange = (index, event) => {
    const updatedRow = [...newRow];
    updatedRow[index] = event.target.value;
    setNewRow(updatedRow);
  };

    const handleGradeChange = (delta) => {
    setGrade(prev => {
      const newGrade = prev + delta;
      if ((newGrade==1 || newGrade==2) && prev==3){
        if (classroom==14){
          handleClassChange(-2);
        } else if (classroom==13){
          handleClassChange(-1);
        }
      }
      return newGrade < 1 ? 1 : newGrade > 3 ? 3 : newGrade;
    });
  };

  const handleClassChange = (delta) => {
    setClassroom(prev => {
      /*
      const newClass = prev + delta;
      return newClass < 1 ? 1 : newClass > 15 ? 15 : newClass;
      */
      const newClass = prev + delta;
      if (grade==3){
        if (0<newClass && newClass<15){
          return newClass;
        } else{
          return prev;
        }
      } else{
        if (0<newClass && newClass<13){
          return newClass;
        } else{
          return prev;
        }
      }
    });
  };

  const lunchmenu = ["","","찰보리밥test\n청국장test찌개(5.6.9.10)\n통삼겹오븐구이&쌈장(5.6.10.13)\n비빔국수(5.6.9.13)\n(자율)상추&깻잎\n배추겉절이(9)\n귤\n* 에너지/단백질/칼슘/철\n855.5/40.4/163.2/3.2","찰보리밥\n청국장찌개(5.6.9.10)\n통삼겹오븐구이&쌈장(5.6.10.13)\n비빔국수(5.6.9.13)\n(자율)상추&깻잎\n배추겉절이(9)\n귤\n* 에너지/단백질/칼슘/철\n855.5/40.4/163.2/3.2","","","오색미밥\n얼큰쇠고기국(5.6.16.18)\n뿌링클치킨&대만연유찹쌀치즈볼\n(1.2.5.6.13.15.16.18)\n청포묵무침\n(자율)고구마줄기볶음\n배추김치(9)\n젤리블리(2.5)\n* 에너지/단백질/칼슘/철\n789.8/34.0/167.3/2.2","홍국쌀밥\n순두부찌개(5.9.10)\n언양식돼지불고기&파채무침\n(4.5.6.10.13.15.16)\n크림스파게티(1.2.5.6.10.13.16)\n(자율)마카다미아멸치볶음(5.6.13)\n열무김치(9)\n요아정(1.2.5.6.13)\n* 에너지/단백질/칼슘/철\n892.4/37.5/321.0/4.6","해물칼국수(5.6.9.13.17.18)\n유부주먹밥(5.6.13.18)\n생선까스&새우칩(1.2.5.6.9)\n배추겉절이(9)\n수제고르곤졸라피자(1.2.5.6)\n망고수박\n* 에너지/단백질/칼슘/철\n818.9/34.3/372.6/3.8","찰보리밥\n닭개장(5.6.15.18)\n오리불고기(5.6.13)\n(자율)무쌈\n납작만두&비빔야채(5.6)\n알감자버터구이(2.5.13)\n배추김치(9)\n착즙사과주스\n* 에너지/단백질/칼슘/철\n838.1/46.4/175.5/5.2","발아현미밥\n등뼈감자탕(5.6.9.10.18)\n고추잡채&꽃빵(5.6.10.13.18)\n청양계란말이&케첩(1.12)\n(자율)가지나물(5.6)\n깍두기(9)\n크림슨포도\n* 에너지/단백질/칼슘/철\n803.3/46.2/212.6/4.8","","","오색미밥\n참치김치찌개(5.9)\n생등심돈카츠&저당소스(1.2.5.6.10)\n마파두부(5.6.10.12.13.18)\n열무김치(9)\n(자율)찰옥수수(13)\n복숭아요거트(2)\n* 에너지/단백질/칼슘/철\n931.3/36.1/385.7/4.0","홍국쌀밥\n장어국(5.6)\n연잎오리훈제&머스터드소스(1.5.6.13)\n일식계란찜(1.5.6.13)\n(자율)거제송화고버섯볶음\n배추김치(9)\n구슬톡톡아이스크림(2)\n* 에너지/단백질/칼슘/철\n958.8/41.6/190.0/2.1","초계국수(1.5.6.13.15.16)\n(자율)쌀밥\n해물파전(1.5.6.9.13.17.18)\n(자율)오징어어묵무침(5.6.13.17)\n열무김치(9)\n수박\n블랙회오리감자(1.2.5.6.17)\n* 에너지/단백질/칼슘/철\n751.1/29.4/150.2/2.9","마크니커리&난(2.5.6.10.12.13.16.18)\n미소장국(5.6)\n탄두리치킨(1.6.15)\n바나나망고샐러드(1.2.5.6)\n(자율)무청시래기된장지짐(5.6)\n깍두기(9)\n딸기우유(2)\n* 에너지/단백질/칼슘/철\n1,037.7/42.3/269.4/3.7","미트스파게티(1.2.5.6.10.12.13)\n(자율)순두부탕(5)\n돈마호크(2.5.6.10.16)\n컬리감자튀김(5.6)\n수제야채피클(13)\n깍두기(9)\n수제레몬에이드(13)\n* 에너지/단백질/칼슘/철\n993.5/29.8/146.6/4.2"];
  const dinnermenu = ["","","","치킨마요덮밥(1.5.6.13.15)\n김치콩나물국(5.9)\n콘치즈범벅불닭함박\n(1.2.5.6.10.12.13.15.16.18)\n깍두기(9)\n망고찹쌀링떡(2.5.6)\n레드용과주스","","","짬짜면-자장면(5.6.10.13.16)\n짬짜면-짬뽕(5.6.9.10.17.18)\n블루베리수제탕수육(1.2.5.6.10.13)\n꼬들단무지\n배추김치(9)\n흑당버블티라떼(2.13)","누룽지능이백숙(15)\n로제떡볶이(1.2.5.6.10.12.13.15.16)\n배추겉절이(9)\n프렌치토스트&메이플시럽(1.2.5.6.13)\n감귤푸딩","","쌀밥\n돼지국밥&소면사리(6.9.10)\n옥수수김치전(5.6.9.13.17)\n부추양파무침(5.6.13)\n석박지(9)\n타코야끼(1.2.5.6.10.12.13.16)\n골드키위","우동(1.2.5.6.7.9.18)\n김치참치밥버거(1.5.9.13)\n깍두기(9)\n(자율)꿀토마토(12)\n감자핫도그(1.2.5.6.10.16.18)\n과일슬러쉬(13)","","","쌀밥\n새알미역국(5.6)\n온두부&볶음김치(5.9.13)\n달걀만두(1.5.6.13)\n닭꼬치(5.6.15.16)\n깍두기(9)\n자두맛음료","새우볶음밥(1.5.6.9.13.18)\n마라탕(2.5.6.9.10.13.15.16)\n애플레몬찹쌀꿔바로우(1.5.6.10.13)\n중국식오이탕탕이(13)\n(자율)모닝글로리볶음\n배추김치(9)\n구워만든곡물과자(1.2.3.5.6.16)","","돈코츠라멘(1.2.5.6.10.13.15.16)\n참치마요삼각밥(1.2.5.6.9.13.16.18)\n수제에그갈릭토스트(1.2.5.6.13)\n깍두기(9)\n엔요플레인요구르트(2)\n크림슨포도","쌀밥\n아욱국\n돼지갈비후라이드&청양마요소스\n(5.6.10.13.16.18)\n레몬크림새우(1.5.6.9.13)\n배추김치(9)\n바나나초코와플(1.2.5.6.13)"];
  
  const today = new Date();
  const day = today.getDate();
  const lunch = lunchmenu[day-1];
  const dinner = dinnermenu[day-1];  
  
  return (
    <div>
      <h1>시간표</h1>

      {/* 학년/반 선택 UI */}
      <div style={{ marginBottom: '20px', display: 'flex', alignItems: 'center', gap: '20px', display: 'flex', justifyContent: 'center', alignItems: 'center'}}>
        <div>
          <button onClick={() => handleGradeChange(-1)}>{'<'}</button>
          <span style={{ margin: '0 10px' }}>{grade}</span>
          <button onClick={() => handleGradeChange(1)}>{'>'}</button>
          <span> 학년</span>
        </div>
        <div>
          <button onClick={() => handleClassChange(-1)}>{'<'}</button>
          <span style={{ margin: '0 10px' }}>{classroom}</span>
          <button onClick={() => handleClassChange(1)}>{'>'}</button>
          <span> 반</span>
        </div>
      </div>

      {/* timetable 표 */}
      <table style={{ width: '100%', height: '400px', tableLayout: 'fixed', borderCollapse: 'collapse' }}>
        <thead>
          <tr>
            <th></th>
            <th>월</th>
            <th>화</th>
            <th>수</th>
            <th>목</th>
            <th>금</th>
          </tr>
        </thead>
        <tbody>
          {timetable[grade-1][classroom-1].map((row, rowIndex) => (
            <tr key={rowIndex}>
              {row.map((cell, colIndex) => (
                <td key={colIndex} style={{ height: '50px', border: '1px solid black', textAlign: 'center', whiteSpace: 'pre' }}>{cell}</td>
                //<td key={colIndex}>{cell}</td>
              ))}
            </tr>
          ))}
        </tbody>
      </table>
      <div>
          <h1><Link to={"/home"}>커뮤니티</Link></h1>
      </div>
      <div>
            <table style={{ borderCollapse: 'collapse' }}>
              <tbody>
                <tr>
                  <td style={{ width: '50%', height: '50px', border: '1px solid black' }}>중식</td>
                  <td style={{ width: '50%', height: '50px', border: '1px solid black' }}>석식</td>
                </tr>
                <tr>
                  <td style={{ width: '50%', border: '1px solid black' }}>
          {lunch.split('\n').map((line, index) => (
          <React.Fragment key={index}>
            {line}
            <br />
          </React.Fragment>
          ))}</td>
                  <td style={{ width: '50%', border: '1px solid black' }}>
            {dinner.split('\n').map((line, index) => (
            <React.Fragment key={index}>
              {line}
              <br />
            </React.Fragment>
            ))}</td>
                </tr>
              </tbody>
            </table>
      </div>
    </div>
  );
}
