import React, { useEffect, useState } from "react";
import "./App.css";
import { Link, useNavigate, useLocation } from "react-router-dom";

export default function Timetable() {
  // timetable 배열 상태 관리
  /*
  const [timetable, setTimetable] = useState([
    ['1교시','B','G','D','D','F'],
    ['2교시','','','','H','A'],
    ['3교시','C','C','E','','D'],
    ['4교시','H','A','','',''],
    ['5교시','','','C','F','G'],
    ['6교시','','자율','동아리','A','B'],
    ['7교시','E','','','B','']
  ]);
  */
  const [timetable, setTimetable] = useState([[[['1교시', '통사', '공수', '통과', '통사', '공영'], ['2교시', '음악', '기가', '여유', '진로', '한국'], ['3교시', '체육', '과탐', '통사', '기가', '공수'], ['4교시', '한국', '공국', '통과', '통과', '통과'], ['5교시', '공수', '한국', '공국', '음악', '공국'], ['6교시', '체육', '자율', '동아', '공수', '기가'], ['7교시', '공영', '자율', '', '공영', '통사']], [['1교시', '기가', '통사', '공영', '통과', '진로'], ['2교시', '여유', '공영', '공국', '공국', '기가'], ['3교시', '공수', '체육', '공수', '공수', '통과'], ['4교시', '체육', '음악', '한국', '한국', '공수'], ['5교시', '통사', '과탐', '통사', '기가', '통사'], ['6교시', '통과', '자율', '동아', '공영', '공국'], ['7교시', '한국', '자율', '', '음악', '통과']], [['1교시', '음악', '한국', '공수', '공영', '공수'], ['2교시', '공수', '공국', '통사', '기가', '진로'], ['3교시', '한국', '통과', '기가', '과탐', '여유'], ['4교시', '체육', '통사', '음악', '공국', '체육'], ['5교시', '공국', '기가', '한국', '공수', '공영'], ['6교시', '통과', '자율', '동아', '통사', '통사'], ['7교시', '공영', '자율', '', '통과', '통과']], [['1교시', '체육', '음악', '통과', '공영', '한국'], ['2교시', '공영', '한국', '통사', '공수', '통과'], ['3교시', '공국', '통사', '진로', '통사', '통사'], ['4교시', '과탐', '공수', '공영', '체육', '공국'], ['5교시', '통과', '여유', '기가', '공국', '기가'], ['6교시', '공수', '자율', '동아', '한국', '음악'], ['7교시', '기가', '자율', '', '통과', '공수']], [['1교시', '공영', '체육', '음악', '진로', '한국'], ['2교시', '공국', '여유', '공국', '음악', '체육'], ['3교시', '기가', '기가', '공수', '공수', '통사'], ['4교시', '공수', '통사', '한국', '공국', '공영'], ['5교시', '과탐', '통과', '통사', '한국', '공수'], ['6교시', '통사', '자율', '동아', '통과', '통과'], ['7교시', '통과', '자율', '', '공영', '기가']], [['1교시', '한국', '체육', '한국', '공국', '공영'], ['2교시', '체육', '공수', '기가', '과탐', '통과'], ['3교시', '통과', '공국', '통과', '공영', '음악'], ['4교시', '통사', '한국', '공영', '통사', '공수'], ['5교시', '기가', '여유', '통사', '통과', '진로'], ['6교시', '공수', '자율', '동아', '기가', '통사'], ['7교시', '음악', '자율', '', '공수', '공국']], [['1교시', '진로', '통사', '한국', '통사', '미술'], ['2교시', '미술', '체육', '공수', '정보', '정보'], ['3교시', '통과', '정보', '공국', '공국', '여유'], ['4교시', '한국', '공영', '과탐', '공수', '통사'], ['5교시', '공국', '공수', '통과', '통과', '통과'], ['6교시', '통사', '자율', '동아', '공영', '체육'], ['7교시', '공수', '자율', '', '한국', '공영']], [['1교시', '공수', '공수', '통사', '과탐', '통과'], ['2교시', '체육', '통과', '한국', '여유', '공수'], ['3교시', '통사', '통사', '공영', '미술', '공영'], ['4교시', '정보', '공영', '통과', '공국', '통사'], ['5교시', '진로', '체육', '미술', '정보', '정보'], ['6교시', '한국', '자율', '동아', '공수', '한국'], ['7교시', '공국', '자율', '', '통과', '공국']], [['1교시', '통과', '미술', '미술', '정보', '통과'], ['2교시', '한국', '공영', '통사', '통사', '통사'], ['3교시', '정보', '통과', '공국', '공수', '공국'], ['4교시', '공영', '공수', '정보', '한국', '한국'], ['5교시', '공수', '공국', '공영', '진로', '여유'], ['6교시', '체육', '자율', '동아', '과탐', '공수'], ['7교시', '통사', '자율', '', '통과', '체육']], [['1교시', '한국', '통과', '공수', '체육', '공국'], ['2교시', '통사', '공국', '한국', '통과', '체육'], ['3교시', '공영', '미술', '통사', '공영', '통과'], ['4교시', '과탐', '한국', '진로', '통사', '여유'], ['5교시', '정보', '정보', '정보', '공수', '공수'], ['6교시', '공수', '자율', '동아', '공국', '공영'], ['7교시', '통과', '자율', '', '미술', '통사']], [['1교시', '공수', '통사', '한국', '공영', '통사'], ['2교시', '한국', '한국', '공수', '공수', '미술'], ['3교시', '통사', '통과', '통과', '여유', '공수'], ['4교시', '공국', '공국', '공국', '정보', '공영'], ['5교시', '통과', '미술', '과탐', '통사', '체육'], ['6교시', '공영', '자율', '동아', '진로', '정보'], ['7교시', '정보', '자율', '', '체육', '통과']], [['1교시', '한국', '공국', '통과', '통사', '통과'], ['2교시', '과탐', '정보', '공영', '정보', '공수'], ['3교시', '공수', '통사', '한국', '체육', '체육'], ['4교시', '통과', '통과', '미술', '여유', '진로'], ['5교시', '통사', '공영', '공수', '공국', '공영'], ['6교시', '미술', '자율', '동아', '공수', '통사'], ['7교시', '공국', '자율', '', '한국', '정보']]], [[['1교시', 'D', '문학', 'F', '중국', '영어'], ['2교시', 'A', 'B', 'C', '수학', '수학'], ['3교시', '문학', '여유', '운동', 'A', '중국'], ['4교시', '운동', '영어', '영어', 'B', 'B'], ['5교시', 'C', 'A', '수학', '영어', '문학'], ['6교시', 'B', '자율', '동아', '문학', '진로'], ['7교시', '수학', '자율', '', 'F', 'A']], [['1교시', 'D', '수학', 'F', 'E', '수학'], ['2교시', 'A', 'B', 'C', '문학', '문학'], ['3교시', '영어', '문학', '문학', 'A', '진로'], ['4교시', '수학', '영어', '영어', 'B', 'B'], ['5교시', 'C', 'A', '여유', '수학', '영어'], ['6교시', 'B', '자율', '동아', '운동', 'D'], ['7교시', '운동', '자율', '', 'F', 'A']], [['1교시', 'D', '문학', '중국', 'E', '영어'], ['2교시', 'A', 'B', 'C', '영어', '여유'], ['3교시', '운동', '영어', '수학', 'A', '진로'], ['4교시', '문학', '수학', '문학', 'B', 'B'], ['5교시', 'C', 'A', '운동', '문학', '수학'], ['6교시', 'B', '자율', '동아', '수학', 'D'], ['7교시', '영어', '자율', '', '중국', 'A']], [['1교시', 'D', '문학', 'F', 'E', '운동'], ['2교시', 'A', 'B', '공실', '수학', '영어'], ['3교시', '문학', '수학', '문학', 'A', 'E'], ['4교시', '영어', '여유', '수학', 'B', 'B'], ['5교시', '공실', 'A', '영어', '영어', '문학'], ['6교시', 'B', '자율', '동아', '운동', 'D'], ['7교시', '수학', '자율', '', '진로', 'A']], [['1교시', '공실', '영어', '보건', 'E', '수학'], ['2교시', 'A', 'B', 'C', '문학', '문학'], ['3교시', '영어', '운동', '영어', 'A', 'E'], ['4교시', '수학', '문학', '문학', 'B', 'B'], ['5교시', 'C', 'A', '수학', '수학', '여유'], ['6교시', 'B', '자율', '동아', '영어', '공실'], ['7교시', '운동', '자율', '', '진로', 'A']], [['1교시', 'D', '수학', 'F', 'E', '문학'], ['2교시', 'A', 'B', 'C', '운동', '영어'], ['3교시', '수학', '문학', '영어', 'A', 'E'], ['4교시', '영어', '영어', '여유', 'B', 'B'], ['5교시', 'C', 'A', '운동', '문학', '수학'], ['6교시', 'B', '자율', '동아', '수학', 'D'], ['7교시', '문학', '자율', '', '진로', 'A']], [['1교시', '보건', '수학', 'F', '공실', '문학'], ['2교시', 'A', 'B', 'C', '영어', '여유'], ['3교시', '수학', '영어', '영어', 'A', '공실'], ['4교시', '문학', '운동', '수학', 'B', 'B'], ['5교시', 'C', 'A', '문학', '수학', '운동'], ['6교시', 'B', '자율', '동아', '문학', '진로'], ['7교시', '영어', '자율', '', 'F', 'A']], [['1교시', 'D', '영어', 'F', '보건', '영어'], ['2교시', 'A', 'B', '중국', '수학', '운동'], ['3교시', '영어', '여유', '수학', 'A', '진로'], ['4교시', '수학', '문학', '운동', 'B', 'B'], ['5교시', '중국', 'A', '문학', '영어', '수학'], ['6교시', 'B', '자율', '동아', '문학', 'D'], ['7교시', '문학', '자율', '', 'F', 'A']], [['1교시', 'D', '운동', 'F', 'E', '수학'], ['2교시', 'A', 'B', 'C', '문학', '영어'], ['3교시', '문학', '수학', '문학', 'A', 'E'], ['4교시', '영어', '여유', '영어', 'B', 'B'], ['5교시', '진로', 'A', '수학', '운동', '문학'], ['6교시', 'B', '자율', '동아', '영어', 'D'], ['7교시', '수학', '자율', '', 'F', 'A']], [['1교시', 'D', '문학', '영어', 'E', '문학'], ['2교시', 'A', 'B', '보건', '수학', '수학'], ['3교시', '공실', '공실', '운동', 'A', 'E'], ['4교시', '수학', '운동', '수학', 'B', 'B'], ['5교시', '진로', 'A', '문학', '문학', '영어'], ['6교시', 'B', '자율', '동아', '여유', 'D'], ['7교시', '영어', '자율', '', '영어', 'A']], [['1교시', '중국', '수학', 'F', 'E', '수학'], ['2교시', 'A', 'B', 'C', '영어', '문학'], ['3교시', '수학', '운동', '수학', 'A', 'E'], ['4교시', '영어', '문학', '여유', 'B', 'B'], ['5교시', '진로', 'A', '영어', '운동', '영어'], ['6교시', 'B', '자율', '동아', '문학', '중국'], ['7교시', '문학', '자율', '', 'F', 'A']], [['1교시', 'D', '영어', '공실', 'E', '영어'], ['2교시', 'A', 'B', 'C', '운동', '문학'], ['3교시', '운동', '문학', '영어', 'A', 'E'], ['4교시', '문학', '수학', '문학', 'B', 'B'], ['5교시', '진로', 'A', '여유', '수학', '수학'], ['6교시', 'B', '자율', '동아', '영어', 'D'], ['7교시', '수학', '자율', '', '공실', 'A']]], [[['1교시', 'B', '진로', 'D', 'D', 'F'], ['2교시', '생환', '확통', '스생', '독서', 'A'], ['3교시', 'C', 'C', 'E', '확통', 'D'], ['4교시', '영작', 'A', '여유', '영작', '영작'], ['5교시', '독서', '독서', 'C', 'F', 'G'], ['6교시', '확통', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '생환']], [['1교시', 'B', '진로', 'D', 'D', '독서'], ['2교시', '여유', '생환', '영작', 'H', 'A'], ['3교시', 'C', 'C', 'E', '스생', 'D'], ['4교시', 'H', 'A', '확통', '영작', '생환'], ['5교시', '영작', '확통', 'C', '독서', 'G'], ['6교시', '독서', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '확통']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '확통', '영작', '확통', 'H', 'A'], ['3교시', 'C', 'C', 'E', '여유', 'D'], ['4교시', 'H', 'A', '독서', '독서', '영작'], ['5교시', '스생', '독서', 'C', '진로', 'G'], ['6교시', '영작', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '확통']], [['1교시', 'B', 'G', 'D', 'D', '음연'], ['2교시', '영작', '영작', '영작', 'H', 'A'], ['3교시', 'C', 'C', 'E', '확통', 'D'], ['4교시', 'H', 'A', '스생', '독서', '확통'], ['5교시', '확통', '여유', 'C', '진로', 'G'], ['6교시', '독서', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '독서']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '영작', '확통', '독서', '진로', 'A'], ['3교시', 'C', 'C', 'E', '영작', 'D'], ['4교시', '음연', 'A', '여유', '확통', '스생'], ['5교시', '독서', '독서', 'C', 'F', 'G'], ['6교시', '확통', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '영작']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '영작', '여유', '영작', '진로', 'A'], ['3교시', 'C', 'C', 'E', '영작', 'D'], ['4교시', 'H', 'A', '독서', '확통', '독서'], ['5교시', '스생', '독서', 'C', 'F', 'G'], ['6교시', '확통', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '확통']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '여유', '독서', '스생', '진로', 'A'], ['3교시', 'C', 'C', 'E', '확통', 'D'], ['4교시', 'H', 'A', '영작', '영작', '확통'], ['5교시', '독서', '확통', 'C', 'F', 'G'], ['6교시', '영작', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '독서']], [['1교시', 'B', '진로', 'D', 'D', 'F'], ['2교시', '스생', '확통', '확통', 'H', 'A'], ['3교시', 'C', 'C', 'E', '여유', 'D'], ['4교시', 'H', 'A', '독서', '독서', '영작'], ['5교시', '확통', '영작', 'C', 'F', 'G'], ['6교시', '영작', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '독서']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '독서', '스생', '영작', 'H', 'A'], ['3교시', 'C', 'C', '음연', '독서', 'D'], ['4교시', 'H', 'A', '확통', '영작', '독서'], ['5교시', '확통', '확통', 'C', 'F', 'G'], ['6교시', '여유', '자율', '동아', 'A', 'B'], ['7교시', '진로', '자율', '', 'B', '영작']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '확통', '영작', '독서', 'H', 'A'], ['3교시', 'C', 'C', 'E', '독서', 'D'], ['4교시', 'H', 'A', '영작', '확통', '확통'], ['5교시', '독서', '여유', 'C', 'F', 'G'], ['6교시', '스생', '자율', '동아', 'A', 'B'], ['7교시', '진로', '자율', '', 'B', '영작']], [['1교시', 'B', 'G', 'D', 'D', 'F'], ['2교시', '여유', '영작', '확통', 'H', 'A'], ['3교시', 'C', 'C', 'E', '영작', 'D'], ['4교시', 'H', 'A', '스생', '독서', '독서'], ['5교시', '영작', '독서', 'C', 'F', 'G'], ['6교시', '확통', '자율', '동아', 'A', 'B'], ['7교시', '진로', '자율', '', 'B', '확통']], [['1교시', 'B', '진로', 'D', 'D', 'F'], ['2교시', '독서', '여유', '확통', 'H', 'A'], ['3교시', 'C', 'C', 'E', '영작', 'D'], ['4교시', 'H', 'A', '독서', '독서', '영작'], ['5교시', '확통', '스생', 'C', 'F', '음연'], ['6교시', '영작', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '확통']], [['1교시', 'B', '영작', 'D', 'D', 'F'], ['2교시', '확통', '확통', '독서', 'H', 'A'], ['3교시', 'C', 'C', 'E', '음연', 'D'], ['4교시', 'H', 'A', '확통', '스생', '진로'], ['5교시', '영작', '여유', 'C', 'F', '독서'], ['6교시', '독서', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '영작']], [['1교시', 'B', 'G', 'D', 'D', '영작'], ['2교시', '진로', '독서', '독서', 'H', 'A'], ['3교시', 'C', 'C', 'E', '독서', 'D'], ['4교시', 'H', 'A', '여유', '영작', '확통'], ['5교시', '영작', '확통', 'C', '음연', 'G'], ['6교시', '확통', '자율', '동아', 'A', 'B'], ['7교시', 'E', '자율', '', 'B', '스생']]]]);
  
  const [newRow, setNewRow] = useState(Array(8).fill('')); // 새로운 행에 추가할 값들
  const [grade, setGrade] = useState(1);
  const [classroom, setClassroom] = useState(1);
  const [floor, setFloor] = useState(1);

  // 새로운 행 추가 함수
  const addRow = () => {
    setTimetable([...timetable, newRow]);
    setNewRow(Array(8).fill('')); // 새로운 행을 추가한 후, 입력값 초기화
  };

  // 입력값을 상태에 반영하는 함수
  const handleInputChange = (index, event) => {
    const updatedRow = [...newRow];
    updatedRow[index] = event.target.value;
    setNewRow(updatedRow);
  };

    const handleGradeChange = (delta) => {
    setGrade(prev => {
      const newGrade = prev + delta;
      if ((newGrade==1 || newGrade==2) && prev==3){
        if (classroom==14){
          handleClassChange(-2);
        } else if (classroom==13){
          handleClassChange(-1);
        }
      }
      return newGrade < 1 ? 1 : newGrade > 3 ? 3 : newGrade;
    });
  };

  const handleClassChange = (delta) => {
    setClassroom(prev => {
      /*
      const newClass = prev + delta;
      return newClass < 1 ? 1 : newClass > 15 ? 15 : newClass;
      */
      const newClass = prev + delta;
      if (grade==3){
        if (0<newClass && newClass<15){
          return newClass;
        } else{
          return prev;
        }
      } else{
        if (0<newClass && newClass<13){
          return newClass;
        } else{
          return prev;
        }
      }
    });
  };

  const handleFloorChange = (delta) => {
    setFloor(prev => {
      const newFloor = prev + delta;
      return newFloor < 1 ? 1 : newFloor > 5 ? 5 : newFloor;
    });
  };

  const lunchmenu = ["","","찰보리밥test\n청국장test찌개(5.6.9.10)\n통삼겹오븐구이&쌈장(5.6.10.13)\n비빔국수(5.6.9.13)\n(자율)상추&깻잎\n배추겉절이(9)\n귤\n* 에너지/단백질/칼슘/철\n855.5/40.4/163.2/3.2","찰보리밥\n청국장찌개(5.6.9.10)\n통삼겹오븐구이&쌈장(5.6.10.13)\n비빔국수(5.6.9.13)\n(자율)상추&깻잎\n배추겉절이(9)\n귤\n* 에너지/단백질/칼슘/철\n855.5/40.4/163.2/3.2","","","오색미밥\n얼큰쇠고기국(5.6.16.18)\n뿌링클치킨&대만연유찹쌀치즈볼\n(1.2.5.6.13.15.16.18)\n청포묵무침\n(자율)고구마줄기볶음\n배추김치(9)\n젤리블리(2.5)\n* 에너지/단백질/칼슘/철\n789.8/34.0/167.3/2.2","홍국쌀밥\n순두부찌개(5.9.10)\n언양식돼지불고기&파채무침\n(4.5.6.10.13.15.16)\n크림스파게티(1.2.5.6.10.13.16)\n(자율)마카다미아멸치볶음(5.6.13)\n열무김치(9)\n요아정(1.2.5.6.13)\n* 에너지/단백질/칼슘/철\n892.4/37.5/321.0/4.6","해물칼국수(5.6.9.13.17.18)\n유부주먹밥(5.6.13.18)\n생선까스&새우칩(1.2.5.6.9)\n배추겉절이(9)\n수제고르곤졸라피자(1.2.5.6)\n망고수박\n* 에너지/단백질/칼슘/철\n818.9/34.3/372.6/3.8","찰보리밥\n닭개장(5.6.15.18)\n오리불고기(5.6.13)\n(자율)무쌈\n납작만두&비빔야채(5.6)\n알감자버터구이(2.5.13)\n배추김치(9)\n착즙사과주스\n* 에너지/단백질/칼슘/철\n838.1/46.4/175.5/5.2","발아현미밥\n등뼈감자탕(5.6.9.10.18)\n고추잡채&꽃빵(5.6.10.13.18)\n청양계란말이&케첩(1.12)\n(자율)가지나물(5.6)\n깍두기(9)\n크림슨포도\n* 에너지/단백질/칼슘/철\n803.3/46.2/212.6/4.8","","","오색미밥\n참치김치찌개(5.9)\n생등심돈카츠&저당소스(1.2.5.6.10)\n마파두부(5.6.10.12.13.18)\n열무김치(9)\n(자율)찰옥수수(13)\n복숭아요거트(2)\n* 에너지/단백질/칼슘/철\n931.3/36.1/385.7/4.0","홍국쌀밥\n장어국(5.6)\n연잎오리훈제&머스터드소스(1.5.6.13)\n일식계란찜(1.5.6.13)\n(자율)거제송화고버섯볶음\n배추김치(9)\n구슬톡톡아이스크림(2)\n* 에너지/단백질/칼슘/철\n958.8/41.6/190.0/2.1","초계국수(1.5.6.13.15.16)\n(자율)쌀밥\n해물파전(1.5.6.9.13.17.18)\n(자율)오징어어묵무침(5.6.13.17)\n열무김치(9)\n수박\n블랙회오리감자(1.2.5.6.17)\n* 에너지/단백질/칼슘/철\n751.1/29.4/150.2/2.9","마크니커리&난(2.5.6.10.12.13.16.18)\n미소장국(5.6)\n탄두리치킨(1.6.15)\n바나나망고샐러드(1.2.5.6)\n(자율)무청시래기된장지짐(5.6)\n깍두기(9)\n딸기우유(2)\n* 에너지/단백질/칼슘/철\n1,037.7/42.3/269.4/3.7","미트스파게티(1.2.5.6.10.12.13)\n(자율)순두부탕(5)\n돈마호크(2.5.6.10.16)\n컬리감자튀김(5.6)\n수제야채피클(13)\n깍두기(9)\n수제레몬에이드(13)\n* 에너지/단백질/칼슘/철\n993.5/29.8/146.6/4.2"];
  const dinnermenu = ["","","","치킨마요덮밥(1.5.6.13.15)\n김치콩나물국(5.9)\n콘치즈범벅불닭함박\n(1.2.5.6.10.12.13.15.16.18)\n깍두기(9)\n망고찹쌀링떡(2.5.6)\n레드용과주스","","","짬짜면-자장면(5.6.10.13.16)\n짬짜면-짬뽕(5.6.9.10.17.18)\n블루베리수제탕수육(1.2.5.6.10.13)\n꼬들단무지\n배추김치(9)\n흑당버블티라떼(2.13)","누룽지능이백숙(15)\n로제떡볶이(1.2.5.6.10.12.13.15.16)\n배추겉절이(9)\n프렌치토스트&메이플시럽(1.2.5.6.13)\n감귤푸딩","","쌀밥\n돼지국밥&소면사리(6.9.10)\n옥수수김치전(5.6.9.13.17)\n부추양파무침(5.6.13)\n석박지(9)\n타코야끼(1.2.5.6.10.12.13.16)\n골드키위","우동(1.2.5.6.7.9.18)\n김치참치밥버거(1.5.9.13)\n깍두기(9)\n(자율)꿀토마토(12)\n감자핫도그(1.2.5.6.10.16.18)\n과일슬러쉬(13)","","","쌀밥\n새알미역국(5.6)\n온두부&볶음김치(5.9.13)\n달걀만두(1.5.6.13)\n닭꼬치(5.6.15.16)\n깍두기(9)\n자두맛음료","새우볶음밥(1.5.6.9.13.18)\n마라탕(2.5.6.9.10.13.15.16)\n애플레몬찹쌀꿔바로우(1.5.6.10.13)\n중국식오이탕탕이(13)\n(자율)모닝글로리볶음\n배추김치(9)\n구워만든곡물과자(1.2.3.5.6.16)","","돈코츠라멘(1.2.5.6.10.13.15.16)\n참치마요삼각밥(1.2.5.6.9.13.16.18)\n수제에그갈릭토스트(1.2.5.6.13)\n깍두기(9)\n엔요플레인요구르트(2)\n크림슨포도","쌀밥\n아욱국\n돼지갈비후라이드&청양마요소스\n(5.6.10.13.16.18)\n레몬크림새우(1.5.6.9.13)\n배추김치(9)\n바나나초코와플(1.2.5.6.13)"];
  
  const today = new Date();
  const day = today.getDate();
  const lunch = lunchmenu[day-1];
  const dinner = dinnermenu[day-1];  

  const [shaking, setShaking] = useState(false);
  const [showLuck, setShowLuck] = useState(false);
  const [message, setMessage] = useState("포츈쿠키");

  const textbox = [
    "오늘은 행운이 당신의 편! 새로운 도전을 두려워하지 마세요.",
    "뜻밖의 기쁨이 찾아올 거예요. 마음을 활짝 열고 기다려보세요!",
    "금전운 상승! 작은 투자도 좋은 결과를 낼 수 있어요.",
    "사람들과의 만남에서 큰 인연이 생길 수 있습니다.",
    "집중력이 최고조! 원하는 목표에 한 걸음 더 다가갑니다.",
  ];
  
  useEffect(() => {
  let timer;
  if (shaking) {
    timer = setTimeout(() => {
      const randomIndex = Math.floor(Math.random() * textbox.length);
      setMessage(textbox[randomIndex]);
      setShowLuck(true);
      setShaking(false);
    }, 1000);
  }
  return () => clearTimeout(timer);
}, [shaking]);

  const handleClick = () => {
    if (!showLuck) {
      setShaking(true);
    } else{
      setShowLuck(false);
    }
  };

  return (
    <div>
      <h1>시간표</h1>

      {/* 학년/반 선택 UI */}
      <div style={{ marginBottom: '20px', display: 'flex', alignItems: 'center', gap: '20px', display: 'flex', justifyContent: 'center', alignItems: 'center'}}>
        <div>
          <button onClick={() => handleGradeChange(-1)}>{'<'}</button>
          <span style={{ margin: '0 10px' }}>{grade}</span>
          <button onClick={() => handleGradeChange(1)}>{'>'}</button>
          <span> 학년</span>
        </div>
        <div>
          <button onClick={() => handleClassChange(-1)}>{'<'}</button>
          <span style={{ margin: '0 10px' }}>{classroom}</span>
          <button onClick={() => handleClassChange(1)}>{'>'}</button>
          <span> 반</span>
        </div>
      </div>

      {/* timetable 표 */}
      <table style={{ width: '100%', height: '400px', tableLayout: 'fixed', borderCollapse: 'collapse' }}>
        <thead>
          <tr>
            <th></th>
            <th>월</th>
            <th>화</th>
            <th>수</th>
            <th>목</th>
            <th>금</th>
          </tr>
        </thead>
        <tbody>
          {timetable[grade-1][classroom-1].map((row, rowIndex) => (
            <tr key={rowIndex}>
              {row.map((cell, colIndex) => (
                <td key={colIndex} style={{ height: '50px', border: '1px solid black', textAlign: 'center', whiteSpace: 'pre' }}>{cell}</td>
                //<td key={colIndex}>{cell}</td>
              ))}
            </tr>
          ))}
        </tbody>
      </table>
      <div>
          <h1>급식</h1>
      </div>
      <div>
            <table style={{ width: '100%', borderCollapse: 'collapse' }}>
              <tbody>
                <tr>
                  <td style={{ width: '50%', height: '50px', border: '1px solid black' }}>중식</td>
                  <td style={{ width: '50%', height: '50px', border: '1px solid black' }}>석식</td>
                </tr>
                <tr>
                  <td style={{ width: '50%', border: '1px solid black' }}>
          {lunch.split('\n').map((line, index) => (
          <React.Fragment key={index}>
            {line}
            <br />
          </React.Fragment>
          ))}</td>
                  <td style={{ width: '50%', border: '1px solid black' }}>
            {dinner.split('\n').map((line, index) => (
            <React.Fragment key={index}>
              {line}
              <br />
            </React.Fragment>
            ))}</td>
                </tr>
              </tbody>
            </table>
      </div>
      <div>
          <h1>지도</h1>
      </div>
      <div>
          <button onClick={() => handleFloorChange(-1)}>{'<'}</button>
          <span style={{ margin: '0 10px' }}>{floor}</span>
          <button onClick={() => handleFloorChange(1)}>{'>'}</button>
          <span> 층</span>
          <br/>
          <br/>
      </div>
      <div>
          <img 
            src={floor === 1 ? 'floor1.png' : floor === 2 ? 'floor2.png' : floor === 3 ? 'floor3.png' : floor === 4 ? 'floor4.png' : floor === 5 ? 'floor5.png' : 'floor1.png'} 
            alt="배치도"
            style={{ width: '100%' }}
          />
      </div>
      <div>
          <h1>오늘의 운세</h1>
      </div>
      <div
        onClick={handleClick}
        style={{
          width: "200px",
          height: "200px",
          cursor: "pointer",
          border: "0px solid #ccc",
          display: "flex",
          justifyContent: "center",
          alignItems: "center",
          padding: "10px",
          textAlign: "center",
          userSelect: "none",
          backgroundColor: "#fff",
          boxSizing: "border-box",
          position: "relative",
        }}
        className={shaking ? "shake" : ""}
      >
        {showLuck ? (
          <div style={{ fontSize: "16px", color: "#333", display: flex, justify-content: center}}>{message}</div>
        ) : (
          <img
            src="fortunecookie.png"
            alt="fortune cookie"
            style={{ width: "100%", height: "100%", objectFit: "contain", display: flex, justify-content: center}}
          />
        )}
      </div>

      <div>
          <h1><Link to={"/home"}>커뮤니티</Link></h1>
      </div>
    </div>
  );
}
